# -*- coding: utf-8 -*-

"""
类属性与实例属性
"""


# ------------------------------------------------------------------------------------------
# 给实例绑定属性的方法是通过实例变量或者self变量
# ------------------------------------------------------------------------------------------
class A(object):

    def __init__(self, name):
        self.name = name


a = A("Max")
a.score = 20  # 动态添加属性score


# ------------------------------------------------------------------------------------------
# 除此之外，还可以给类绑定属性，这种属性归类所有，而不是对象
# ------------------------------------------------------------------------------------------
class B(object):
    name = "Bob"


b = B()
print(b.name)  # 打印name属性，由于实例没有name属性，将会查找类属性，显示Bob
print(B.name)  # 打印name属性，由于实例没有name属性，将会查找类属性，显示Bob
b.name = "Lala"  # 注意，这里等于是给实例添加了一个name属性
print(b.name)  # 打印name属性，由于实例有同名属性，而实例属性比类属性优先级高，所以覆盖掉了类属性。显示Lala
del b.name  # 删除实例属性
print(b.name)
